---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.ContinuousRail
source: html/2106bbe7-bb09-e472-e187-b044ee5dc3db.htm
---
# ContinuousRail Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.